{
  "criteria": [
    {
      "category": "Campos a completar",
      "rules": [
        "Se debe validar los campos obligatorios y mostrar una marca para distinguirlos.",
        "Tooltip con las características del campo.",
        "Mensaje de error.",
        "Validación de correo electrónico: formato que contenga @ y .com o .edu, que no esté repetido en la base. Mensajes de error claros.",
        "Validación de DNI (máximo 8 caracteres), CUIT (máximo 11 caracteres), etc. Placeholder con formatos admitidos.",
        "Validación de reglas de contraseñas: mínimo 8 caracteres, 1 mayúscula, 1 minúscula, 1 carácter especial y 1 número.",
        "Mostrar reglas de contraseñas a ser validadas.",
        "Desplazamiento entre campos con la tecla TAB."
      ],
      "field_types": {
        "Numérico": "Utilizar enteros/decimales.",
        "Alfanumérico": "Utilizar enteros/decimales/caracteres/caracteres especiales.",
        "String": "No permitir URLs. Restricciones de caracteres especiales.",
        "Fecha": "Validación de rango (desde-hasta, límites en cada caso que lo requiera).",
        "Desplegable": "Debe tener un valor, no repetidos, orden alfabético."
      }
    },
    {
      "category": "Tablas",
      "rules": [
        "Alineación de las columnas centradas.",
        "Tipografía contenida en las columnas.",
        "Alineación de datos: número centrado, texto a la izquierda, importes a la derecha, booleanos centrados.",
        "Paginación en las listas y selector de cantidad de datos por página.",
        "Ordenamiento de los datos de las tablas por columna ascendente y descendente."
      ]
    },
    {
      "category": "Mensajes de confirmación de acciones",
      "rules": [
        "Cada acción debe tener un modal de confirmación (Crear, Modificar, Eliminar, Cancelar).",
        "Mensaje acorde a la acción realizada.",
        "El foco debe estar en el botón No/Cancelar en los mensajes de confirmación."
      ]
    },
    {
      "category": "Notificaciones",
      "rules": [
        "Debe existir un mail estándar reutilizable para cambio de contraseña.",
        "Envío de doble factor de autenticación."
      ]
    },
    {
      "category": "Interacciones y Usabilidad",
      "rules": [
        "Spinner en toda acción que demore en cargarse y el botón se debe bloquear.",
        "Iconos estándar para eliminar y modificar, habilitados o deshabilitados según las condiciones de los datos.",
        "Botón verde para aceptar o continuar, botón rojo para cancelar.",
        "Mensajes de error claros, en lenguaje coloquial y no técnico."
      ]
    },
    {
      "category": "Búsquedas",
      "rules": [
        "Validación en los rangos en una búsqueda (desde-hasta).",
        "Contemplar los límites para establecer rangos acordes con la pantalla."
      ]
    }
  ]
}
